EDT/УТ/src/Documents/мгЗагрузкаИзЗУП/мгЗагрузкаИзЗУП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгЗагрузкаИзЗУП</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АвансЗарПлата</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсполнительныйЛист</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОтпускныеБольничные</name>
    <attributes>
      <name>ТабельныйНомер</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/InformationRegisters/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ/мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ</name>
  <comment>(Миго-Групп)</comment>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТабельныйНомерВИсточнике</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникДанныхДляРасчетаФОТ</name>
    <type>
      <types>CatalogRef.мгИсточникиДанныхДляРасчетаФОТ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/мгИсточникиДанныхДляРасчетаФОТ/мгИсточникиДанныхДляРасчетаФОТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>мгИсточникиДанныхДляРасчетаФОТ</name>
  <attributes>
    <name>База</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Логин</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛогинСерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пароль</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольСерв</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РасположениеБазы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сервер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтрокаСоединения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФПоказатьПароль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФТипБазыФайловая</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФСоединениеПротестировано</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Удержания</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Documents/мгЗагрузкаИзЗУП/Forms/ФормаДокументаУпр/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если Параметры.Ключ.Пустая() Тогда
		Объект.ПериодРегистрации = НачалоМесяца(Объект.Дата);
	КонецЕсли;
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
	
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаПриИзменении(Элемент)
	РаботаСДиалогами.ДатаКакМесяцПодобратьДатуПоТексту(МесяцСтрока, Объект.ПериодРегистрации);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура МесяцСтрокаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	Объект.ПериодРегистрации = ДобавитьМесяц(Объект.ПериодРегистрации, Направление);
	МесяцСтрока = РаботаСДиалогами.ДатаКакМесяцПредставление(Объект.ПериодРегистрации);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Ответственный = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОтветственный");
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьИспЛисты(Команда)
	
	Если Объект.ИсполнительныйЛист.Количество() <> 0 Тогда
		Если Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
			ЗаполнитьИсполнительныеЛистыНаСервере();
			
			Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
		КонецЕсли;
	Иначе 
		Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
		ЗаполнитьИсполнительныеЛистыНаСервере();
			
		Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокТабельныхНомеров()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомерВИсточнике
	               |ИЗ
	               |	РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	               |ГДЕ
	               |	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация = &Организация
	               |	И мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ИсточникДанныхДляРасчетаФОТ = &ИсточникДанныхДляРасчетаФОТ";
	Запрос.УстановитьПараметр("Организация",Объект.Организация);
	Запрос.УстановитьПараметр("ИсточникДанныхДляРасчетаФОТ",Объект.ИсточникДанныхДляРасчетаФОТ);
	
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выбрать();
	МассивВозврата = Новый Массив;
	Пока ВыборкаТЗ.Следующий() Цикл
		МассивВозврата.Добавить(ВыборкаТЗ.ТабельныйНомерВИсточнике);
	КонецЦикла;
	Возврат МассивВозврата;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьИсполнительныеЛистыНаСервере()
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	ПодстрокиВерсии = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СистемнаяИнфо.ВерсияПриложения,".");
	Connector = Новый ComОбъект("v" + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + ".ComConnector");
	Попытка
		БД_ЗУП=Connector.Connect(Объект.ИсточникДанныхДляРасчетаФОТ.СтрокаСоединения);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();;
	КонецПопытки;	
	Если БД_ЗУП = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка соединения с базой ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// В зависимости от версии конфигурации ЗУП будут выполняться разный запрос (т.к. структура разная)
	ВерсияКонфигурации = БД_ЗУП.Metadata.Version;
	МассивВерсииКонфигурации =  ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ВерсияКонфигурации, ".");
	Если МассивВерсииКонфигурации.Количество() <> 0 Тогда
		
		Если МассивВерсииКонфигурации[0] = "2" Тогда
			ЗаполнитьИсполнительныеЛисты_v25_НаСервере(БД_ЗУП);			
		ИначеЕсли МассивВерсииКонфигурации[0] = "3" Тогда 	
			ЗаполнитьИсполнительныеЛисты_v31_НаСервере(БД_ЗУП);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Версия конфигурации ЗУП " + ВерсияКонфигурации + "не соответствует";
			Сообщение.Сообщить();
		КонецЕсли; 
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Версия конфигурации ЗУП не определено, загрузка данных не может быть выполнена.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	БД_ЗУП = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИсполнительныеЛисты_v25_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = "ВЫБРАТЬ
	|УдержанияРаботниковОрганизаций.ПериодРегистрации,
	|УдержанияРаботниковОрганизаций.ВидРасчета,
	|УдержанияРаботниковОрганизаций.ФизЛицо,
	|УдержанияРаботниковОрганизаций.Организация,
	|УдержанияРаботниковОрганизаций.Результат,
	|УдержанияРаботниковОрганизаций.Сотрудник,
	|СотрудникиОрганизаций.Код КАК ТабельныйНомер
	|ИЗ
	|РегистрРасчета.УдержанияРаботниковОрганизаций КАК УдержанияРаботниковОрганизаций
	|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|	ПО УдержанияРаботниковОрганизаций.ФизЛицо = СотрудникиОрганизаций.Физлицо
	|ГДЕ
	|УдержанияРаботниковОрганизаций.Активность = ИСТИНА
	|И УдержанияРаботниковОрганизаций.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	|И УдержанияРаботниковОрганизаций.ВидРасчета.Наименование В(&СписокУдержаний)
	|И СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)";
	
	СписокУд = БД_ЗУП.NewObject("СписокЗначений");
	Для каждого СтрокаУд Из Объект.ИсточникДанныхДляРасчетаФОТ.Удержания Цикл
		СписокУд.Добавить(СтрокаУд.Наименование);
	КонецЦикла;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("СписокУдержаний", СписокУд);
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике";
	
	Объект.ИсполнительныйЛист.Загрузить(Запрос2.Выполнить().Выгрузить());
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьИсполнительныеЛисты_v31_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Код КАК ТабельныйНомер,
	|	Удержания.Результат
	| ИЗ
	|	РегистрРасчета.Удержания КАК Удержания
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО Удержания.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	Удержания.Активность = ИСТИНА
	|	И Удержания.ПериодРегистрации МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Удержания.ВидРасчета.Наименование В(&СписокУдержаний)
	|	И Сотрудники.Код В(&СписокТабельныхНомеров)";
	
	СписокУд = БД_ЗУП.NewObject("СписокЗначений");
	Для каждого СтрокаУд Из Объект.ИсточникДанныхДляРасчетаФОТ.Удержания Цикл
		СписокУд.Добавить(СтрокаУд.Наименование);
	КонецЦикла;
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	Запрос.УстановитьПараметр("СписокУдержаний", СписокУд);
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике";
	
	Объект.ИсполнительныйЛист.Загрузить(Запрос2.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЗПАванс(Команда)
	
	Если Объект.АвансЗарПлата.Количество() <> 0 Тогда
		Если Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
			ЗаполнитьАванаЗПНаСервере();
			
			Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
		КонецЕсли;
	Иначе 
		Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
		ЗаполнитьАванаЗПНаСервере();
			
		Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАванаЗПНаСервере()
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	ПодстрокиВерсии = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СистемнаяИнфо.ВерсияПриложения,".");
	Connector = Новый ComОбъект("v" + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + ".ComConnector");
	Попытка
		БД_ЗУП=Connector.Connect(Объект.ИсточникДанныхДляРасчетаФОТ.СтрокаСоединения);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();;
	КонецПопытки;	
	Если БД_ЗУП = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка соединения с базой ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// В зависимости от версии конфигурации ЗУП будут выполняться разный запрос (т.к. структура разная)
	ВерсияКонфигурации = БД_ЗУП.Metadata.Version;
	МассивВерсииКонфигурации =  ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ВерсияКонфигурации, ".");
	Если МассивВерсииКонфигурации.Количество() <> 0 Тогда
		
		Если МассивВерсииКонфигурации[0] = "2" Тогда
			ЗаполнитьАванаЗП_v25_НаСервере(БД_ЗУП);			
		ИначеЕсли МассивВерсииКонфигурации[0] = "3" Тогда 	
			ЗаполнитьАванаЗП_v31_НаСервере(БД_ЗУП);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Версия конфигурации ЗУП " + ВерсияКонфигурации + "не соответствует";
			Сообщение.Сообщить();
		КонецЕсли; 
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Версия конфигурации ЗУП не определено, загрузка данных не может быть выполнена.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	БД_ЗУП = Неопределено;

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАванаЗП_v25_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	|	СотрудникиОрганизаций.Код КАК ТабельныйНомер,
	|	СУММА(ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов) КАК Результат
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ВзаиморасчетыСРаботникамиОрганизаций.Физлицо = СотрудникиОрганизаций.Физлицо
	|ГДЕ
	|	СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ХарактерВыплаты В (ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.Зарплата), ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.ПлановыйАванс), ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.ПоБольничнымЛистам), ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.Отпускные), ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.РасчетПриУвольнении))
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ПериодВзаиморасчетов = &НачалоПериода
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.Код";
	//"ВЫБРАТЬ
	//|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	//|	СУММА(ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.СуммаВзаиморасчетовРасход) КАК Результат,
	//|	СотрудникиОрганизаций.Код КАК ТабельныйНомер
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, ДвиженияИГраницыПериода, ) КАК ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	//|		ПО ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Физлицо = СотрудникиОрганизаций.Физлицо
	//|ГДЕ
	//|	СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)
	//|
	//|СГРУППИРОВАТЬ ПО
	//|	СотрудникиОрганизаций.Ссылка,
	//|	СотрудникиОрганизаций.Код";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике";
	
	Объект.АвансЗарПлата.Загрузить(Запрос2.Выполнить().Выгрузить());
	
	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьАванаЗП_v31_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	Сотрудники.Код КАК ТабельныйНомер,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов) КАК Результат
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВзаиморасчетыССотрудниками.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.Код В(&СписокТабельныхНомеров)
	|	И ВзаиморасчетыССотрудниками.ВидВзаиморасчетов В (ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаЗарплаты), ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаАванса), ЗНАЧЕНИЕ(Перечисление.ВидыВзаиморасчетовССотрудниками.ВыплатаВМежрасчетныйПериод))	
	|	И ВзаиморасчетыССотрудниками.Период = &НачалоПериода
	|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка,
	|	Сотрудники.Код";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|	
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике";
	
	Объект.АвансЗарПлата.Загрузить(Запрос2.Выполнить().Выгрузить());	
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьОтпускБольнКомпен(Команда)
	
	Если Объект.ОтпускныеБольничные.Количество() <> 0 Тогда
		Если Вопрос("Табличная часть будет перезаполнена. Продолжить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
			ЗаполнитьБольничныеНаСервере();
			
			Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
		КонецЕсли;
	Иначе 
		Сообщить("------------------ Начат обмен данными в "+ТекущаяДата());
	
		ЗаполнитьБольничныеНаСервере();
			
		Сообщить("------------------ Закончен обмен данными в " + ТекущаяДата());
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБольничныеНаСервере()
	
	СистемнаяИнфо = Новый СистемнаяИнформация;
	ПодстрокиВерсии = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СистемнаяИнфо.ВерсияПриложения,".");
	Connector = Новый ComОбъект("v" + ПодстрокиВерсии[0] + ПодстрокиВерсии[1] + ".ComConnector");
	Попытка
		БД_ЗУП=Connector.Connect(Объект.ИсточникДанныхДляРасчетаФОТ.СтрокаСоединения);
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();;
	КонецПопытки;	
	Если БД_ЗУП = Неопределено Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Ошибка соединения с базой ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	// В зависимости от версии конфигурации ЗУП будут выполняться разный запрос (т.к. структура разная)
	ВерсияКонфигурации = БД_ЗУП.Metadata.Version;
	МассивВерсииКонфигурации =  ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ВерсияКонфигурации, ".");
	Если МассивВерсииКонфигурации.Количество() <> 0 Тогда
		
		Если МассивВерсииКонфигурации[0] = "2" Тогда
			ЗаполнитьБольничные_v25_НаСервере(БД_ЗУП);			
		ИначеЕсли МассивВерсииКонфигурации[0] = "3" Тогда 	
			ЗаполнитьБольничные_v31_НаСервере(БД_ЗУП);
		Иначе
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Версия конфигурации ЗУП " + ВерсияКонфигурации + "не соответствует";
			Сообщение.Сообщить();
		КонецЕсли; 
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Версия конфигурации ЗУП не определено, загрузка данных не может быть выполнена.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	БД_ЗУП = Неопределено;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБольничные_v25_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.СуммаВзаиморасчетовПриход КАК Результат,
	//|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	//|	СотрудникиОрганизаций.Код КАК ТабельныйНомер
	//|ИЗ
	//|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, ДвиженияИГраницыПериода, ) КАК ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	//|		ПО ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Физлицо = СотрудникиОрганизаций.Физлицо
	//|ГДЕ
	//|	(ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
	//|			ИЛИ ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту
	//|			ИЛИ ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Регистратор ССЫЛКА Документ.РасчетПриУвольненииРаботникаОрганизаций)
	//|	И СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)";
	"ВЫБРАТЬ
	|	СотрудникиОрганизаций.Код КАК ТабельныйНомер,
	|	СотрудникиОрганизаций.Ссылка КАК Сотрудник,
	|	ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.СуммаВзаиморасчетовПриход КАК Результат
	|ПОМЕСТИТЬ вр
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, ДвиженияИГраницыПериода, ) КАК ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Физлицо = СотрудникиОрганизаций.Физлицо
	|ГДЕ
	|	(ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Регистратор ССЫЛКА Документ.НачислениеОтпускаРаботникамОрганизаций
	|			ИЛИ ВзаиморасчетыСРаботникамиОрганизацийОстаткиИОбороты.Регистратор ССЫЛКА Документ.НачислениеПоБольничномуЛисту)
	|	И СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)

	|ОБЪЕДИНИТЬ ВСЕ

	|ВЫБРАТЬ
	|	СотрудникиОрганизаций.Код,
	|	СотрудникиОрганизаций.Ссылка,
	|	СУММА(ВзаиморасчетыСРаботникамиОрганизаций.СуммаВзаиморасчетов)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСРаботникамиОрганизаций КАК ВзаиморасчетыСРаботникамиОрганизаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СотрудникиОрганизаций КАК СотрудникиОрганизаций
	|		ПО ВзаиморасчетыСРаботникамиОрганизаций.Физлицо = СотрудникиОрганизаций.Физлицо
	|ГДЕ
	|	СотрудникиОрганизаций.Код В(&СписокТабельныхНомеров)
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ХарактерВыплаты В (ЗНАЧЕНИЕ(Перечисление.ХарактерВыплатыЗарплаты.РасчетПриУвольнении))
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ПериодВзаиморасчетов = &НачалоПериода
	|	И ВзаиморасчетыСРаботникамиОрганизаций.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)

	|СГРУППИРОВАТЬ ПО
	|	СотрудникиОрганизаций.Ссылка,
	|	СотрудникиОрганизаций.Код
	|;

	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр.ТабельныйНомер,
	|	вр.Сотрудник,
	|	СУММА(вр.Результат) КАК Результат
	|ИЗ
	|	вр КАК вр

	|СГРУППИРОВАТЬ ПО
	|	вр.ТабельныйНомер,
	|	вр.Сотрудник

	|УПОРЯДОЧИТЬ ПО
	|	вр.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|УПОРЯДОЧИТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник.Наименование";
	
	Объект.ОтпускныеБольничные.Загрузить(Запрос2.Выполнить().Выгрузить());
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьБольничные_v31_НаСервере(БД_ЗУП)
	
	Запрос =  БД_ЗУП.NewObject("Запрос");
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Сотрудники.Код КАК ТабельныйНомер,
	|	Сотрудники.Ссылка КАК Сотрудник,
	|	ВзаиморасчетыССотрудникамиОстаткиИОбороты.СуммаВзаиморасчетовПриход КАК Результат
	|ПОМЕСТИТЬ вр
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Регистратор, ДвиженияИГраницыПериода, ) КАК ВзаиморасчетыССотрудникамиОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВзаиморасчетыССотрудникамиОстаткиИОбороты.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	(ВзаиморасчетыССотрудникамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.Отпуск
	|			ИЛИ ВзаиморасчетыССотрудникамиОстаткиИОбороты.Регистратор ССЫЛКА Документ.БольничныйЛист)
	|	И Сотрудники.Код В(&СписокТабельныхНомеров)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Сотрудники.Код,
	|	Сотрудники.Ссылка,
	|	СУММА(ВзаиморасчетыССотрудниками.СуммаВзаиморасчетов)
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыССотрудниками КАК ВзаиморасчетыССотрудниками
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
	|		ПО ВзаиморасчетыССотрудниками.ФизическоеЛицо = Сотрудники.ФизическоеЛицо
	|ГДЕ
	|	Сотрудники.Код В(&СписокТабельныхНомеров)
	|	И (ВзаиморасчетыССотрудниками.Регистратор ССЫЛКА Документ.Увольнение
	|	ИЛИ ВзаиморасчетыССотрудниками.Регистратор ССЫЛКА Документ.УвольнениеСписком)
	|	И ВзаиморасчетыССотрудниками.Период = &НачалоПериода
	//|	И ВзаиморасчетыССотрудниками.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|
	|СГРУППИРОВАТЬ ПО
	|	Сотрудники.Ссылка,
	|	Сотрудники.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вр.ТабельныйНомер,
	|	вр.Сотрудник,
	|	СУММА(вр.Результат) КАК Результат
	|ИЗ
	|	вр КАК вр
	|
	|СГРУППИРОВАТЬ ПО
	|	вр.ТабельныйНомер,
	|	вр.Сотрудник
	|
	|УПОРЯДОЧИТЬ ПО
	|	вр.Сотрудник.Наименование";
	
	Запрос.УстановитьПараметр("НачалоПериода", Объект.ПериодРегистрации);
	Запрос.УстановитьПараметр("КонецПериода", КонецМесяца(Объект.ПериодРегистрации));
	СписокТабНомер = БД_ЗУП.NewObject("СписокЗначений");
	МассивТабельных = ПолучитьСписокТабельныхНомеров();
	Для каждого Табельный Из МассивТабельных Цикл
		СписокТабНомер.Добавить(Строка(Табельный));
	КонецЦикла;
	Запрос.УстановитьПараметр("СписокТабельныхНомеров", СписокТабНомер);
	Результат = Запрос.Выполнить();
	ВыборкаТЗ = Результат.Выгрузить();
	
	Если ВыборкаТЗ.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Получен нулевой результат из ЗУП";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	КЧ = Новый КвалификаторыЧисла(15,2);
	КС = Новый КвалификаторыСтроки(10);
	ТЗДляЗапроса = Новый ТаблицаЗначений;
	ТЗДляЗапроса.Колонки.Добавить("ТабельныйНомер", Новый ОписаниеТипов("Строка",,,,КС));
	ТЗДляЗапроса.Колонки.Добавить("Результат", Новый ОписаниеТипов("Число"));
	Для каждого СтрокаТЗ Из ВыборкаТЗ Цикл
		НоваяСтрока = ТЗДляЗапроса.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЗ);
	КонецЦикла;
	
	Запрос2 = Новый Запрос;
	Запрос2.УстановитьПараметр("тбл", ТЗДляЗапроса);
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	т.Результат КАК Результат,
	|	т.ТабельныйНомер КАК ТабельныйНомер
	|ПОМЕСТИТЬ втТбл
	|ИЗ
	|	&тбл КАК т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник КАК Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация КАК Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике КАК ТабельныйНомер,
	|	СУММА(втТбл.Результат) КАК Сумма
	|ИЗ
	|	втТбл КАК втТбл
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ КАК мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ
	|		ПО втТбл.ТабельныйНомер = мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|СГРУППИРОВАТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Организация,
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.ТабельныйНомерВИсточнике
	|
	|УПОРЯДОЧИТЬ ПО
	|	мгСоответствиеСотрудниковВИсточникахДляРасчетаФОТ.Сотрудник.Наименование";
	
	Объект.ОтпускныеБольничные.Загрузить(Запрос2.Выполнить().Выгрузить());
	
КонецПроцедуры
	
&НаКлиенте
Процедура ИсточникДанныхДляРасчетаФОТПриИзменении(Элемент)
	Если не Объект.ИсточникДанныхДляРасчетаФОТ.ФСоединениеПротестировано Тогда 
		Сообщить("Нельзя выбрать источник не прощедший тестирование соединения!");
		Объект.ИсточникДанныхДляРасчетаФОТ = Справочники.мгИсточникиДанныхДляРасчетаФОТ.ПустаяСсылка();
	КонецЕсли;
КонецПроцедуры
